// 1.1 ) เขียน function แสดงค่าทาง console โดย function รับ parameter 2 ตัว ได้แก่

// - firstName: String
// - lastName: String
// - ผลลัพธ์ที่ได้ อยู่ในรูปแบบ

//     ```json
//     “Hello Shippop, My name is {{firstName}} {{lastName}}”
//     ```

// - เงื่อนไขเพิ่มเติม
//     - ถ้า firstName เท่ากับ คำว่า “Shippop” แสดง "Best Online Shipping Platform"

const shippop = (firstName, lastName) => {
  if (firstName === "Shippop") {
    return console.log("Best Online Shipping Platform");
  }
  return console.log(`Hello Shippop, My name is ${firstName} ${lastName}`);
};

// Test
shippop("Shippop", "Pansila");

// 1.2 ) ถ้าหากต้องการ copy “array of object” ใน Nodejs มีวิธีการใดบ้าง ยกตัวอย่างมาอย่างน้อย 1 วิธี
const arrayOfObject = [
  {
    id: 1,
    name: "รสชาติของผลไม้ที่ยังไม่สุกงอม",
    rate: 4,
    review: "4",
    price: 550.0,
    discount: 0.09274,
    writer: "โชนัมจู",
    publisher: "Piccolo",
    category: "วรรณกรรม เรื่องสั้น",
    productType: "Books",
    barcode: "978161840488",
    detail: `ก่อนที่ชีวิตของเด็กสาววัยย่างสิบหกปีทั้งสี่คนจะได้สัมผัสกับความหวานหอมจากผลไม้รสชาติที่สุดในชีวิตพวกเธอจะต้องต่อสู้กับความจริงปวดที่ค่อยๆ\nกัดเซาะจิตใจและผ่านพ้นช่วงชีวิตซึ่งเต็มไปด้วยความยากลําบากนานา\n\nทั้งความคิดที่ว่าตัวเองโดดเดียวแม้อยู่ในกลุ่มเพื่อนที่เหมือนจะรักกันดีหรือแม้จะมีครอบครัวพร้อมหน้า\nความรู้สึกที่ว่าไม่มีใครจริงใจสักคนนั้นคัดกินจิตใจทีละน้อยจนก่อเกิดความหวาดระแวงขึ้นตอนนี้พวกเธอจึงทำได้เพียงพยายามในแบบของตนเอง\nเพื่อผ่านพ้นความไม่คุ้นเคยกยากเข็ญไปให้ได้ไม่ว่าวิธีเหล่านั้นจะถูกหรือผิด ... แล้วงันหนึ่งเมื่อถึงเวลาอาจจะไม่ทั้งหมด\nแต่อย่างน้อยก็จะมีหนึ่งคนที่พูดออกมาได้อย่างเต็มปากเต็มคำว่า "นี่เป็นผลในอร่อยที่สุดเท่าที่จับเคยกินมาตั้งแต่เกิดเลย`,
  },
  {
    id: 2,
    name: "รสชาติของผลไม้ที่ยังไม่สุกงอม",
    rate: 4,
    review: "4",
    price: 550.0,
    discount: 0.09274,
    writer: "โชนัมจู",
    publisher: "Piccolo",
    category: "วรรณกรรม เรื่องสั้น",
    productType: "Books",
    barcode: "978161840488",
    detail: `ก่อนที่ชีวิตของเด็กสาววัยย่างสิบหกปีทั้งสี่คนจะได้สัมผัสกับความหวานหอมจากผลไม้รสชาติที่สุดในชีวิตพวกเธอจะต้องต่อสู้กับความจริงปวดที่ค่อยๆ\nกัดเซาะจิตใจและผ่านพ้นช่วงชีวิตซึ่งเต็มไปด้วยความยากลําบากนานา\n\nทั้งความคิดที่ว่าตัวเองโดดเดียวแม้อยู่ในกลุ่มเพื่อนที่เหมือนจะรักกันดีหรือแม้จะมีครอบครัวพร้อมหน้า\nความรู้สึกที่ว่าไม่มีใครจริงใจสักคนนั้นคัดกินจิตใจทีละน้อยจนก่อเกิดความหวาดระแวงขึ้นตอนนี้พวกเธอจึงทำได้เพียงพยายามในแบบของตนเอง\nเพื่อผ่านพ้นความไม่คุ้นเคยกยากเข็ญไปให้ได้ไม่ว่าวิธีเหล่านั้นจะถูกหรือผิด ... แล้วงันหนึ่งเมื่อถึงเวลาอาจจะไม่ทั้งหมด\nแต่อย่างน้อยก็จะมีหนึ่งคนที่พูดออกมาได้อย่างเต็มปากเต็มคำว่า "นี่เป็นผลในอร่อยที่สุดเท่าที่จับเคยกินมาตั้งแต่เกิดเลย`,
  },
  {
    id: 3,
    name: "รสชาติของผลไม้ที่ยังไม่สุกงอม",
    rate: 4,
    review: "4",
    price: 550.0,
    discount: 0.09274,
    writer: "โชนัมจู",
    publisher: "Piccolo",
    category: "วรรณกรรม เรื่องสั้น",
    productType: "Books",
    barcode: "978161840488",
    detail: `ก่อนที่ชีวิตของเด็กสาววัยย่างสิบหกปีทั้งสี่คนจะได้สัมผัสกับความหวานหอมจากผลไม้รสชาติที่สุดในชีวิตพวกเธอจะต้องต่อสู้กับความจริงปวดที่ค่อยๆ\nกัดเซาะจิตใจและผ่านพ้นช่วงชีวิตซึ่งเต็มไปด้วยความยากลําบากนานา\n\nทั้งความคิดที่ว่าตัวเองโดดเดียวแม้อยู่ในกลุ่มเพื่อนที่เหมือนจะรักกันดีหรือแม้จะมีครอบครัวพร้อมหน้า\nความรู้สึกที่ว่าไม่มีใครจริงใจสักคนนั้นคัดกินจิตใจทีละน้อยจนก่อเกิดความหวาดระแวงขึ้นตอนนี้พวกเธอจึงทำได้เพียงพยายามในแบบของตนเอง\nเพื่อผ่านพ้นความไม่คุ้นเคยกยากเข็ญไปให้ได้ไม่ว่าวิธีเหล่านั้นจะถูกหรือผิด ... แล้วงันหนึ่งเมื่อถึงเวลาอาจจะไม่ทั้งหมด\nแต่อย่างน้อยก็จะมีหนึ่งคนที่พูดออกมาได้อย่างเต็มปากเต็มคำว่า "นี่เป็นผลในอร่อยที่สุดเท่าที่จับเคยกินมาตั้งแต่เกิดเลย`,
  },
];

//methode1
const copy = JSON.parse(JSON.stringify(arrayOfObject));

// // test 1
// copy[0] = {};
// console.log(copy);
// console.log(arrayOfObject);

//methode 2
const copy1 = arrayOfObject.map((item) => item);
// test 2
copy1[0] = {};
console.log(copy1);
console.log(arrayOfObject);
